Autodesk.Navisworks.Api.ViewChange
Specifies type of change being made to a View.

Autodesk.Navisworks.Api.ViewChange.JumpCut
The current viewpoint jumps straight to the new viewpoint.
Collision detection and gravity have no effect.

Autodesk.Navisworks.Api.ViewChange.Navigation
User is interactively navigating from current viewpoint to new viewpoint.
Actual viewpoint set may be modified due to collision detection and gravity.